app/Controllers/Api.php

    public function index()
    {
        $dataobjek = $this->tabeldatalokasiobjek->findAll();
---
SELECT *
FROM "datalokasiobjek"
WHERE "datalokasiobjek"."deleted_at" IS NULL